test/fixture.json

{
  "originalOrder": {
    "id": "04df2b4d-6044-ae29-df11-4bd095d9c306",
    "size": "10.00000000",
    "asset": "BTC-USD",
    "side": "buy",
    "stp": "dc",
    "type": "market",
    "postOnly": false,
    "ctime": "2020-05-07T15:58:30.000000Z",
    "fillFees": "0.0000000000000000",
    "filledSize": "0.00000000",
    "executedValue": "0.0000000000000000",
    "status": "pending",
    "settled": true,
    "_subscription": "volumeSpike-test-assert-buy-true",
    "_destination": "Coinbase",
    "_marketdata": {
      "asset": "USD-BTC",
      "exchange": "coinbase",
      "price": [
        {
          "price": "0",
          "timestamp": "2020-05-07T15:58:33.000Z"
        }
      ],
      "timestamp": "2020-05-07T15:58:21.000Z",
      "aggregateCount": 13,
      "volume": {
        "buy": 0,
        "sell": 6.69776927772909,
        "total": 6.69776927772909
      },
      "avgVolume": 14812.93756,
      "sumVolume": 18940.469469277727,
      "totalVolumeRatio": 1.278643712130636,
      "netDirectionVolumeRatio": null
    },
    "orders": [
      {
        "key": "2ÿUSD-BTCÿ593432c8-0d22-75e2-1113-18f8173adcd4",
        "id": "593432c8-0d22-75e2-1113-18f8173adcd4"
      }
    ],
    "fills": [
      {
        "id": 1,
        "size": 10,
        "asset": "BTC-USD",
        "price": "10000.00000000",
        "side": "buy",
        "liquidity": "T",
        "fee": "0.00025",
        "ctime": "2020-05-07T15:58:30.000000Z",
        "orderId": "04df2b4d-6044-ae29-df11-4bd095d9c306",
        "settled": true,
        "targetLimitPrice": 10500,
        "stopLossPrice": 9800,
        "trailingStopLossTriggerPrice": 10100,
        "trailingStopLossPriceHistory": [],
        "_subscription": "volumeSpike-test-assert-buy-true",
        "_destination": "Coinbase",
        "key": "3ÿUSD-BTCÿ04df2b4d-6044-ae29-df11-4bd095d9c306ÿ1",
        "open": false
      }
    ]
  },
  "closingOrders": [
    {
      "id": "593432c8-0d22-75e2-1113-18f8173adcd4",
      "size": "10.00000000",
      "asset": "BTC-USD",
      "side": "sell",
      "stp": "dc",
      "type": "limit",
      "postOnly": false,
      "ctime": "2020-05-07T15:58:50.000000Z",
      "fillFees": "0.0000000000000000",
      "filledSize": "0.00000000",
      "executedValue": "0.0000000000000000",
      "status": "pending",
      "settled": false,
      "origin": {
        "fillId": 1,
        "orderId": "04df2b4d-6044-ae29-df11-4bd095d9c306",
        "cause": "SLO"
      },
      "sold": true,
      "_subscription": "volumeSpike-test-assert-buy-true",
      "_marketdata": {
        "exchange": "coinbase",
        "asset": "USD-BTC",
        "timestamp": "2020-05-07T15:58:34.000000Z",
        "price": "9960",
        "volume": {
          "buy": 0,
          "sell": "5.67890303535387",
          "total": "5.67890303535387"
        }
      },
      "fills": [
        {
          "id": 2,
          "size": 10,
          "asset": "BTC-USD",
          "price": "9799.00000000",
          "side": "sell",
          "liquidity": "T",
          "fee": "0.00025",
          "ctime": "2020-05-07T15:58:50.000000Z",
          "orderId": "04df2b4d-6044-ae29-df11-4bd095d9c306",
          "settled": true,
          "targetLimitPrice": 10288.95,
          "stopLossPrice": 9603.02,
          "trailingStopLossTriggerPrice": 9896.99,
          "trailingStopLossPriceHistory": [],
          "_subscription": "volumeSpike-test-assert-buy-true",
          "_destination": "Coinbase",
          "key": "3ÿUSD-BTCÿ593432c8-0d22-75e2-1113-18f8173adcd4ÿ2",
          "open": true
        }
      ],
      "aggregate": {
        "size": 10,
        "price": 9799,
        "fee": "0.00025"
      }
    }
  ],
  "summary": {
    "subscription": "volumeSpike-test-assert-buy-true",
    "aggregateCloseSize": 10,
    "isNetTradeZero": true,
    "originalOrderCTime": 1588867110000,
    "originalOrderFillCount": 1,
    "originalOrderTotalCost": 100000,
    "originalOrderTotalSize": 10,
    "originalOrderTotalFee": "0.00025",
    "closingOrdersCTime": 1588867130000,
    "closingOrdersOrderCount": 1,
    "closingOrdersFillCount": 1,
    "closingOrdersTotalProceeds": 97990,
    "closingOrdersTotalFee": "00.00025",
    "pnl": -2010,
    "tradeDuration": 20000,
    "version": "1.0.0"
  }
}
